In [1]:
import pandas as pd ; import numpy as np

In [2]:
dt=pd.DataFrame({"x":["bir","iki"]*3, "y":[1,1,2,3,2,3]})
dt

     x  y
0  bir  1
1  iki  1
2  bir  2
3  iki  3
4  bir  2
5  iki  3

In [3]:
#duplicated() tekrar eden satırları görüntüler. Boolean bir değere döndürür.

dt.duplicated()

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

In [5]:
#drop_duplicates() metodu tekrar eden satırları kaldırır. Veri temizleme***

dt.drop_duplicates()

     x  y
0  bir  1
1  iki  1
2  bir  2
3  iki  3

In [6]:
dt["z"]=range(6)

In [7]:
dt

     x  y  z
0  bir  1  0
1  iki  1  1
2  bir  2  2
3  iki  3  3
4  bir  2  4
5  iki  3  5

In [8]:
dt.duplicated(["x"])

0    False
1    False
2     True
3     True
4     True
5     True
dtype: bool

In [9]:
dt.duplicated(["x","y"])

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

In [10]:
#keep="last" metodu sondan başlayarak tekrar eden değerleri bulur.

dt.duplicated(["x","y"], keep="last")

0    False
1    False
2     True
3     True
4    False
5    False
dtype: bool

In [11]:
#HARİTALAMA(MAPPING)

#bu metod veri setine istediğimiz bir değer atamasını gerçekleştirir.

dtfrm=pd.DataFrame({"ad":["caner","ayşe","fatma","veli","ali"],
                   "not":[13,85,93,74,62]})
dtfrm

      ad  not
0  caner   13
1   ayşe   85
2  fatma   93
3   veli   74
4    ali   62

In [13]:
sinif={"Caner":"A","Ayşe":"A","Fatma":"B","Veli":"B","Ali":"B"}

# sınıf değişkenini veri setine eklemek için map metodu kullanılır. Map metodu ya bir fonksiyon ya da bir sözlük yapısı kabul eder.

In [14]:
ad=dtfrm["ad"].str.capitalize()

In [15]:
dtfrm

      ad  not
0  caner   13
1   ayşe   85
2  fatma   93
3   veli   74
4    ali   62

In [16]:
dtfrm["sube"]=ad.map(sinif)

In [17]:
dtfrm

      ad  not sube
0  caner   13    A
1   ayşe   85    A
2  fatma   93    B
3   veli   74    B
4    ali   62    B

In [25]:
#Değer Atama

nt=pd.Series([80,70,90,60,70])
nt

0    80
1    70
2    90
3    60
4    70
dtype: int64

In [26]:
nt.replace(70,np.nan)

#var olan veriye farklı bir değer atamak için numpy kütüphanesinin fonksiyonu olan replace() kullanılır.

0    80.0
1     NaN
2    90.0
3    60.0
4     NaN
dtype: float64

In [27]:
#birden fazla değer ataması

nt.replace([70,60],[np.nan,35])

0    80.0
1     NaN
2    90.0
3    35.0
4     NaN
dtype: float64

In [28]:
#sözlük yapısı kullanarak değer atama

nt.replace({90:100,80:12})

0     12
1     70
2    100
3     60
4     70
dtype: int64